app/controllers/musicapp_controller.rb

  def show
    @musicapp = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
      @musicapp = Playlist.new(musicapp_params)
      @musicapp.user = current_user
      if @musicapp.save
---
INSERT INTO "playlists" ("playlist_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["playlist_name", "punk"], ["created_at", "2017-09-30 02:49:54.094139"], ["updated_at", "2017-09-30 02:49:54.094139"]]